<template>
  <section :class="$style['section__faq']">
    <h2 :class="$style['section__faq-title']">Часто задаваемые вопросы</h2>
    <base-accordion-tabs
      :controls="controls"
      :active="activeTab"
      @change="(value) => (activeTab = value)"
    />
    <div :class="$style['section__faq-grid']">
      <base-accordions
        v-for="(list, index) in accordionsTabs"
        :key="index"
        v-show="index == activeTab"
        :list="list"
        :class="$style['section__faq-container']"
      >
      </base-accordions>
    </div>
  </section>
</template>

<script lang="ts">
import { Component, Prop, Vue } from 'nuxt-property-decorator'
import { Jsonld } from 'nuxt-jsonld'
import BaseAccordions from '@/components/Base/BaseAccordion/BaseAccordions.vue'
import BaseAccordionTabs from '@/components/Base/BaseAccordion/BaseAccordionTabs.vue'

interface accordionItem {
  title: string
  content: string[]
}

@Jsonld
@Component({
  components: { BaseAccordions, BaseAccordionTabs },
})
export default class LayoutAccordion extends Vue {
  public activeTab = 0

  public controls = ['Категория 1', 'Категория 2', 'Категория 3']

  public accordionsTabs: Array<accordionItem[]> = [
    [
      {
        title:
          'Категория 1 Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Что самое важное в уходе за зубами?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Обязательно ли делать гигиену на каждом приеме врача?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Что самое важное в уходе за зубами?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Обязательно ли делать гигиену на каждом приеме врача?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
    ],
    [
      {
        title:
          'Категория 2 Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Что самое важное в уходе за зубами?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Обязательно ли делать гигиену на каждом приеме врача?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Обязательно ли делать гигиену на каждом приеме врача?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
    ],
    [
      {
        title:
          'Категория 3 Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Что самое важное в уходе за зубами?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Обязательно ли делать гигиену на каждом приеме врача?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Как часто нужно ходить к стоматологу, если ничего не болит?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
      {
        title: 'Что самое важное в уходе за зубами?',
        content: [
          'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          'Существует большое количество мифов о том, что фтор вреден — это неправда. В зубных пастах он в такой концентрации, которая может быть использована без последствий.',
        ],
      },
    ],
  ]

  get list() {
    return (this.accordionsData || []).map((item: any, index: number) => ({
      ...item,
      is_active: index === 0 ? true : item.is_active,
    }))
  }

  jsonld() {
    const items = (this.list || []).map((item: any) => {
      return {
        '@type': 'Question',
        name: item.title,
        acceptedAnswer: {
          '@type': 'Answer',
          text: item.content,
        },
      }
    })

    return {
      '@context': 'https://schema.org',
      '@type': 'FAQPage',
      mainEntity: items,
    }
  }
}
</script>

<style lang="scss" module>
.section__faq {
  background: $color-primary-8;
  padding-top: 80px;
  padding-bottom: 80px;

  &-title {
    @include font-h2-medium;
    margin: 0 auto;
    margin-bottom: 32px;
    width: fit-content;
  }

  &-grid {
    @include grid-container;
    padding: 0 12px;
    margin: 0 auto;
  }

  &-container {
    grid-column: 1 / 6;

    &-text {
      color: $color-gray-88;
    }
  }

  @include media-breakpoint-up('md') {
    &-title {
      margin-bottom: 48px;
    }

    &-container {
      grid-column: 1 / 9;
    }
  }

  @include media-breakpoint-up('lg') {
    padding-top: 96px;
    padding-bottom: 96px;

    &-container {
      grid-column: 2 / 10;
    }
  }

  @include media-breakpoint-up('xl') {
    padding-top: 144px;
    padding-bottom: 144px;

    &-container {
      grid-column: 3 / 11;
    }
  }
}
</style>
