<template>
  <section :class="$style['section__faq']">
    <h2 :class="$style['section__faq-title']">Часто задаваемые вопросы</h2>
    <base-accordion-tabs
      :controls="controls"
      :active="activeTab"
      @change="(value) => (activeTab = value)"
    />
    <div :class="$style['section__faq-grid']">
      <base-accordions
        v-for="(list, index) in accordionsTabs"
        :key="index"
        v-show="index == activeTab"
        :list="list"
        :class="$style['section__faq-container']"
      >
      </base-accordions>
    </div>
  </section>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'
import BaseAccordions from '@/components/Base/BaseAccordion/BaseAccordions.vue'
import BaseAccordionTabs from '@/components/Base/BaseAccordion/BaseAccordionTabs.vue'

interface accordionItem {
  title: string
  content: string[]
}

export default defineComponent({
  name: 'LayoutAccordion',
  components: { BaseAccordions, BaseAccordionTabs },
  data() {
    return {
      activeTab: <number>0,
      controls: <string[]>['Терапия', 'Имплантация', 'Хирургия'],
    }
  },
  computed: {
    accordionsTabs(): Array<accordionItem[]> {
      return [
        [
          // {
          //   title:
          //     'Что такое терапия стоматологии?',
          //   content: [
          //     'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
          //     'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
          //   ],
          // },
          {
            title: 'Как часто мне нужно посещать стоматолога?',
            content: [
              'Рекомендуется посещать стоматолога для регулярного профилактического осмотра и чистки зубов каждые 6 месяцев. Если у вас есть какие-либо проблемы со здоровьем зубов или зубной пломбы, ваш стоматолог может рекомендовать более частые посещения.',
            ],
          },
          {
            title: 'Как уберечь свои зубы от кариеса?',
            content: [
              'Чтобы уберечь свои зубы от кариеса, нужно соблюдать правильную гигиену полости рта. Рекомендуется чистить зубы два раза в день щеткой и зубной пастой, использовать зубную нить и ополаскиватель для рта.',
              'Также следует избегать чрезмерного потребления сладкой и кислой пищи, курения и употребления алкоголя. Регулярное посещение стоматолога для профилактического осмотра также помогает предотвратить кариес и другие заболевания полости рта.',
            ],
          },
          {
            title: 'Что делать, если у меня болит зуб?',
            content: [
              'Если у вас болит зуб, сразу же обратитесь к стоматологу. Боль может быть вызвана различными причинами, от кариеса до повреждения нерва. Только стоматолог сможет определить причину боли и предложить соответствующее лечение.',
              'В домашних условиях вы можете снять боль анальгетиком и использовать холод для уменьшения отека, если он имеется.',
            ],
          },
          {
            title: 'Как выбрать правильную пасту для зубов?',
            content: [
              'Выбор правильной зубной пасты зависит от ваших индивидуальных потребностей. Если у вас чувствительные зубы, выбирайте зубные пасты, которые специально разработаны для чувствительных зубов.',
              'Если вы хотите укрепить эмаль зубов, выбирайте пасты с высоким содержанием фтора. Обратитесь к своему стоматологу, чтобы получить рекомендации по выбору правильной зубной пасты для ваших потребностей.',
            ],
          },
          {
            title:
              'Как часто необходимо проходить профилактический осмотр и чистку зубов?',
            content: [
              'Рекомендуется проходить профилактический осмотр и чистку зубов не реже одного раза в полгода.',
              'Это поможет предотвратить развитие заболеваний полости рта и сохранить здоровье зубов и десен.',
            ],
          },
          {
            title: 'Как происходит лечение зубов под микроскопом?',
            content: [
              'Лечение зубов под микроскопом – это процедура, которая позволяет врачу более точно определить и удалить пораженные участки зуба. Во время процедуры зуб увеличивается в размере до 20-40 раз, что позволяет врачу увидеть даже самые маленькие повреждения зубной ткани.',
              'Это позволяет провести более точное и эффективное лечение, которое позволяет сохранить больше здоровой ткани. Кроме того, лечение зубов под микроскопом позволяет уменьшить риск повторных кариесов и других осложнений, так как врач более точно удаляет пораженные участки и проверяет результаты лечения.',
              'В целом, лечение зубов под микроскопом является одним из самых точных и эффективных методов лечения зубов, который позволяет сохранить их здоровье на долгое время.',
            ],
          },
          {
            title: 'Как можно укрепить зубную эмаль?',
            content: [
              'Для укрепления зубной эмали мы рекомендуем использовать специальные зубные пасты и ополаскиватели, содержащие фториды. Также важно соблюдать правильный режим питания, исключая из рациона кислые и сладкие продукты, которые могут разрушать зубную эмаль',
              'Кроме того, регулярные профилактические осмотры и чистки зубов помогут сохранить зубную эмаль в здоровом состоянии.',
            ],
          },
        ],
        [
          {
            title: 'Что такое имплантация зубов?',
            content: [
              'Имплантация зубов - это процедура замены потерянного зуба, в которой искусственный зуб устанавливается в костную ткань челюсти или верхней челюсти, взаимодействуя с костной тканью в процессе оздоровления.',
            ],
          },
          {
            title: 'Что самое важное в уходе за зубами?',
            content: [
              'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
              'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
            ],
          },
          {
            title:
              'Каковы преимущества имплантации зубов по сравнению с мостовой конструкцией или съемными протезами?',
            content: [
              'Более естественный и комфортный вид зуба, который не движется и не выскальзывает',
              'Улучшение речи и проглатывания благодаря более прочному дополнению зубной дуги',
              'Удобство в еде, т.к. у вас есть более крепкое и надежное основание для жевания',
              'Улучшение уровня уверенности и самооценки благодаря более красивой улыбке и естественному выражению лица',
            ],
          },
          {
            title: 'Как долго держатся имплантаты?',
            content: [
              'Имплантаты могут длиться в течение многих лет, если правильно ухаживать за ними. В среднем, имплантаты могут служить от 10 до 20 лет и даже более. ',
              'Важно следить за гигиеной полости рта и регулярно проходить профессиональную чистку зубов у стоматолога.',
            ],
          },
          {
            title: 'Является ли имплантация безболезненной процедурой?',
            content: [
              'Да, имплантация проводится с применением местной анестезии, поэтому процедура практически безболезненна.',
              'Кроме того, наши специалисты смогут предложить вам дополнительные методы седации, которые помогут снизить тревожность и уменьшить боль.',
            ],
          },
          {
            title:
              'Могу ли я сразу после имплантации продолжать есть и пить обычную пищу?',
            content: [
              'В первые дни после имплантации вы можете испытывать дискомфорт и болевые ощущения, поэтому важно придерживаться мягкой и нежной пищи, избегая твёрдых и горячих продуктов.',
              'Врач проведет с вами подробную консультацию и даст рекомендации относительно питания после имплантации.',
            ],
          },
          {
            title: 'Какой уход требуется после имплантации?',
            content: [
              'После имплантации важно соблюдать гигиену полости рта, регулярно чистить зубы и использовать дезинфицирующие растворы, рекомендованные врачом.',
              'Кроме того, важно следить за тем, чтобы не перегружать имплантаты и избегать твёрдых продуктов, а также регулярно проходить контроль у стоматолога.',
            ],
          },
        ],
        [
          {
            title: 'Как происходит процедура удаления зубов?',
            content: [
              'Перед удалением зуба проводится обезболивание, после чего врач использует специальный инструмент, чтобы ослабить зуб в десне.',
              'Затем зуб аккуратно извлекается из полости рта. Если зуб сложно удалить, то может потребоваться более сложная процедура.',
            ],
          },
          {
            title:
              'Можно ли производить хирургическое лечение зубов при беременности?',
            content: [
              'В некоторых случаях хирургическое лечение зубов можно проводить при беременности, но перед этим необходимо проконсультироваться с врачом и оценить риски и пользу для будущей мамы и ребенка.',
              ' В целом, хирургическое лечение зубов желательно проводить до или после беременности.',
            ],
          },
          {
            title:
              'Какие риски существуют при проведении хирургических процедур в стоматологии?',
            content: [
              'Как и в любой медицинской процедуре, существуют риски, связанные с проведением хирургических процедур в стоматологии, такие как инфекции, кровотечения, повреждения нервов и других тканей.',
              'Однако, квалифицированный хирург-стоматолог проведет необходимые меры предосторожности, чтобы минимизировать эти риски и обеспечить максимальную безопасность пациента.',
            ],
          },
          {
            title:
              'Каковы сроки восстановления после хирургических процедур в стоматологии?',
            content: [
              'Помимо чистки зубов щеткой по 2—3 минуты утром и вечером, важно дополнительно очищать межзубные промежутки, например специальными ершиками или зубной нитью.',
              'Также лучше использовать профилактические пасты, в том числе фторсодержащие — они помогают предотвратить кариес.',
            ],
          },
          {
            title:
              'Какие могут быть осложнения после хирургического вмешательства в полости рта?',
            content: [
              'Возможные осложнения после хирургии могут включать в себя боль, отек, кровотечение, инфекцию, нарушение чувствительности в зоне операции, а также воспаление.',
              'Однако, риск возникновения осложнений можно снизить с помощью правильной подготовки к операции, соблюдения рекомендаций врача после операции и правильного ухода за раной.',
            ],
          },
          {
            title:
              'Какие противопоказания есть для хирургического лечения зубов?',
            content: [
              'Хирургическое лечение зубов может быть противопоказано при наличии острых инфекционных заболеваний, нарушении кровообращения, сердечно-сосудистых заболеваниях, нарушении функций кроветворной системы, диабете, аутоиммунных заболеваниях.',
            ],
          },
          {
            title:
              'Могут ли мои зубы начать расти снова после удаления зуба мудрости?',
            content: [
              'Нет, зубы не начнут расти снова после удаления зуба мудрости. Это потому, что зубы формируются в десне и вырастают только один раз.',
              'Однако, возможно, что существующие зубы могут сдвигаться и изменять положение после удаления зуба мудрости, что может привести к проблемам с прикусом.',
            ],
          },
        ],
      ]
    },
    list() {
      return (this.accordionsData || []).map((item: any, index: number) => ({
        ...item,
        is_active: index === 0 ? true : item.is_active,
      }))
    },
  },
})
</script>

<style lang="scss" module>
.section__faq {
  background: $color-primary-8;
  padding-top: 80px;
  padding-bottom: 80px;

  &-title {
    @include font-h2-medium;
    margin: 0 auto;
    margin-bottom: 32px;
    width: fit-content;
  }

  &-grid {
    @include grid-container;
    padding: 0 12px;
    margin: 0 auto;
  }

  &-container {
    grid-column: 1 / 6;

    &-text {
      color: $color-gray-88;
    }
  }

  @include media-breakpoint-up('md') {
    &-title {
      margin-bottom: 48px;
    }

    &-container {
      grid-column: 1 / 9;
    }
  }

  @include media-breakpoint-up('lg') {
    padding-top: 96px;
    padding-bottom: 96px;

    &-container {
      grid-column: 2 / 10;
    }
  }

  @include media-breakpoint-up('xl') {
    padding-top: 144px;
    padding-bottom: 144px;

    &-container {
      grid-column: 3 / 11;
    }
  }
}
</style>
