{
  "title": "Безопасность и гарантии",
  "slug": "bezopasnost-i-garantii",
  "content": [
    {
      "id": "EjaU0CRF2q",
      "type": "paragraph",
      "data": {
        "text": "Сегодня главная медицинская заповедь \"Не навреди\" все чаще сталкивается с препятствиями, и поэтому на плечи пациента ложится ответственность за то, как получить медицинскую помощь, при этом не подвергая себя риску. Мы настоятельно рекомендуем всем пациентам внимательно изучить этот раздел, чтобы понять, как выбрать клинику и врача, которые обеспечат надлежащую помощь, не угрожая здоровью пациента, и которые предоставят гарантии, т.е. будут отвечать за результаты лечения в рамках установленных стандартов."
      }
    },
    {
      "id": "wSHJ4jtG7T",
      "type": "header",
      "data": {
        "text": "Безопасность стоматологического лечения ",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "e_FqCV1Jak",
      "type": "paragraph",
      "data": {
        "text": "Безопасность стоматологического лечения в \"Авторской стоматологии Терновых\" Безопасность стоматологического лечения обусловлена двумя ключевыми факторами, которые влияют на здоровье и жизнь пациента - это инфекционная безопасность и безопасность использования медицинских препаратов и материалов для предотвращения аллергических реакций и последующих осложнений."
      }
    },
    {
      "id": "E1AkzfiVR6",
      "type": "header",
      "data": {
        "text": "Инфекционная безопасность в стоматологии Терновых",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "8L_SlGg-Lr",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Инфекционная безопасность в \"Авторской стоматологии Терновых\"В основе инфекционной безопасности нашей клиники - строгое соблюдение стандартов асептики и антисептики, в соответствии с СанПиН 2.1.3.2630-10 \"Санитарно-эпидемиологические требования к организациям, осуществляющим медицинскую деятельность\". Мы применяем комплексные санитарно-эпидемиологические меры в рамках программ \"Против СПИДа\" и \"Против гепатита\".",
            "items": []
          },
          {
            "content": "На каждом приеме врач и ассистент используют одноразовые стерильные перчатки и маски.",
            "items": []
          },
          {
            "content": "После каждого приема производится утилизация медицинских отходов и материалов и дезинфекция рабочего места. Все инструменты и посуда, которые использовались врачом, обрабатываются современными дезинфекторами, уничтожающими 95-99% патогенных микроорганизмов и вирусов.",
            "items": []
          },
          {
            "content": "При проведении имплантации для каждого пациента используется отдельный стерильный набор для имплантации, который открывается непосредственно перед пациентом.",
            "items": []
          },
          {
            "content": "Многоразовые медицинские изделия (наконечники, боры, карпульные шприцы, хирургические металлические инструменты, ложки для оттисков и т.д.) проходят многоступенчатую систему стерилизации, включая:",
            "items": []
          }
        ]
      }
    },
    {
      "id": "-RtJtQGsWF",
      "type": "paragraph",
      "data": {
        "text": "- Предварительную очистку и дезинфекцию в дезинфицирующих жидкостях для удаления белковых, жировых и лекарственных загрязнений и первичной дезинфекции;"
      }
    },
    {
      "id": "49h_QdYfdr",
      "type": "paragraph",
      "data": {
        "text": "- Предстерилизационную очистку - тщательное мытье в специальных растворах, а затем в проточной и дистиллированной воде;"
      }
    },
    {
      "id": "9krOR-BPX4",
      "type": "paragraph",
      "data": {
        "text": "- Контроль качества обработки – при обнаружении несоответствия установленным нормам, инструменты проходят повторный цикл обработки,"
      }
    },
    {
      "id": "dwxzAUhfxH",
      "type": "paragraph",
      "data": {
        "text": "- Упаковку и стерилизацию в автоклаве под температурой и давлением."
      }
    },
    {
      "id": "HtYKS5X9cw",
      "type": "header",
      "data": {
        "text": "Безопасное применение медикаментов, включая анестезию, и материалов в \"Авторской стоматологии Терновых\"",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "BufXS8nLyD",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Мы придаем большое значение тщательному сбору медицинской истории (анамнеза) каждого пациента. Это включает в себя информацию о текущем состоянии здоровья, а также перечень всех прошлых и хронических заболеваний, а также учитывает факторы возраста, пола и аллергологического профиля пациента (см. Карта здоровья пациента).",
            "items": []
          },
          {
            "content": "Мы стремимся обеспечить, чтобы каждый пациент получил полную, объективную и точную информацию о своем здоровье, доступных методах лечения, прогнозе, сроках и стоимости лечения.",
            "items": []
          },
          {
            "content": "Мы тщательно разрабатываем план лечения, учитывая текущее состояние здоровья пациента и прогнозируемый исход его заболевания. Мы стараемся разъяснить пациенту все детали его плана лечения, по его желанию вносим в него изменения и окончательно согласовываем план перед началом лечения. Наша цель - чтобы пациент полностью понимал все возможные особенности, которые могут возникнуть в процессе лечения и имел реалистичные ожидания.",
            "items": []
          },
          {
            "content": "Выбор анестетиков, лекарств и материалов для лечения в нашей клинике происходит на индивидуальной основе, в соответствии с аллергологическим профилем пациента.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "voVIPJPoYa",
      "type": "header",
      "data": {
        "text": "Гарантии на стоматологические услуги",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "nCjlV7nTU1",
      "type": "paragraph",
      "data": {
        "text": "Когда пациент оплачивает стоматологические услуги в частной клинике, он становится потребителем. Это означает, что отношения между пациентом и стоматологической клиникой регулируются двумя основными законами: Федеральным законом \"Об основах охраны здоровья граждан в Российской Федерации\" и Законом РФ «О защите прав потребителей»."
      }
    },
    {
      "id": "IkmJCnjMgQ",
      "type": "paragraph",
      "data": {
        "text": "Первый закон подчеркивает, что каждый пациент имеет право на получение верной информации о своем здоровье в понятной форме, включая доступные методы лечения и прогноз исхода. Однако, это не является обязательством пациента – т.е., если пациент не хочет получить эту информацию, врач не имеет права насильно ее предоставлять. Тем не менее, врач ДОЛЖЕН получить согласие пациента на проводимое лечение и в случае отказа – зафиксировать это в письменной форме."
      }
    },
    {
      "id": "qLseVYC17X",
      "type": "paragraph",
      "data": {
        "text": "Иными словами, для начала лечения, врачу требуется согласие пациента на проведение процедуры, но пациент не обязан полностью понимать все детали процесса, если он этого не желает."
      }
    },
    {
      "id": "KIDmCkFgiB",
      "type": "paragraph",
      "data": {
        "text": "Второй закон о правах потребителя устанавливает гарантийный срок для каждой оказанной услуги и говорит о том, что пациент имеет право на компенсацию в случае предоставления некачественной услуги."
      }
    },
    {
      "id": "oEnO5QAf7r",
      "type": "paragraph",
      "data": {
        "text": "Но что это означает на практике?"
      }
    },
    {
      "id": "4Sn0Q7eqoO",
      "type": "header",
      "data": {
        "text": "Что такое «гарантия» в стоматологии?",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "nrK3IKYDwg",
      "type": "paragraph",
      "data": {
        "text": "Это материальная ответственность врача за качество результата его лечения. Качество результата определяется реакцией организма на проведенную процедуру."
      }
    },
    {
      "id": "Vvxsvr1aS6",
      "type": "paragraph",
      "data": {
        "text": "Пациентам следует понимать, что не всегда негативная реакция организма на лечение связана с ошибкой врача. Часто процедура выполняется в соответствии с протоколом, но реакция организма пациента оказывается неожиданной. В большинстве случаев опытный врач может предугадать такую реакцию при сотрудничестве с пациентом, но, если это не произошло, это не считается врач"
      }
    },
    {
      "id": "Cti5qSgioM",
      "type": "header",
      "data": {
        "text": "Как можно установить, что стоматологическое лечение была выполнено плохо?",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "e-3zTkmo3b",
      "type": "paragraph",
      "data": {
        "text": "Только суд может принять такое решение на основании выводов компетентных специалистов. Но это - исключительная ситуация. Поэтому мы придаем большое значение взаимопониманию и сотрудничеству между врачом и пациентом. В случае конфликтных ситуаций, стороны должны стремиться к диалогу и компромиссу. Обычно, в случае претензий, врач выполняет некоторые корректирующие процедуры бесплатно, при этом часть расходов может покрывать пациент."
      }
    },
    {
      "id": "EKJH-NqmCt",
      "type": "header",
      "data": {
        "text": "Индивидуальная гарантия в стоматологии",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "n2hJGuK3qi",
      "type": "paragraph",
      "data": {
        "text": "Врач не в состоянии предоставить универсальную гарантию на идеальный результат для всех своих пациентов после лечения. Результат зависит от многих условий, которые невозможно предвидеть заранее. Поэтому мы можем обсуждать только ИНДИВИДУАЛЬНУЮ гарантию, которую врач и пациент обговаривают в каждом конкретном случае, исходя из конкретной клинической картины. Эта гарантия относится к материальному результату лечения, например, к установленной пломбе, коронке, мосту или имплантату в ротовой полости пациента."
      }
    },
    {
      "id": "q-S5OS0Uk_",
      "type": "header",
      "data": {
        "text": "Условия сохранения гарантии в стоматологии.",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "718DXoE6A0",
      "type": "paragraph",
      "data": {
        "text": "Любая гарантия, будь то на технику или автомобиль, имеет определенные условия, при соблюдении которых она остается действительной на протяжении установленного срока. Например, если владелец автомобиля не проходит технический осмотр в указанные сроки и не меняет масло после определенного пробега, он теряет гарантию."
      }
    },
    {
      "id": "lczNt5pnGH",
      "type": "header",
      "data": {
        "text": "В стоматологии сохранение гарантии подразумевает соблюдение следующих условий:",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "gCLpNRvPNV",
      "type": "paragraph",
      "data": {
        "text": "Любая гарантия, будь то на технику или автомобиль, имеет определенные условия, при соблюдении которых она остается действительной на протяжении установленного срока. Например, если владелец автомобиля не проходит технический осмотр в указанные сроки и не меняет масло после определенного пробега, он теряет гарантию."
      }
    },
    {
      "id": "U_cHMOle7v",
      "type": "header",
      "data": {
        "text": "Условия сохранения гарантии в стоматологии.",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "F11qc7R0u9",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Прохождение профессиональной гигиены один раз в полгода.",
            "items": []
          },
          {
            "content": "Прохождение плановых бесплатных осмотров в установленные сроки.Качественная ежедневная гигиена с использованием средств, рекомендованных врачом.",
            "items": []
          },
          {
            "content": "Ношение исправных ретенционных аппаратов в период после снятия брекетов согласно схеме, утвержденной ортодонтом, является условием гарантии на результат ортодонтического лечения.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "hTXHPqnOrT",
      "type": "paragraph",
      "data": {
        "text": "Однако, есть и негативные факторы, которые могут укорачивать сроки гарантии:"
      }
    },
    {
      "id": "h8pn0nQhBc",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Наличие множественного кариеса.",
            "items": []
          },
          {
            "content": "Заболевания десен.",
            "items": []
          },
          {
            "content": "План лечения, на который настоял пациент, и который не является оптимальным.",
            "items": []
          },
          {
            "content": "Наличие у пациента системных и/или хронических заболеваний, таких как артрит, диабет, остеопороз, заболевания крови, красная волчанка и т.д.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "osEQzql2ZV",
      "type": "paragraph",
      "data": {
        "text": "Средние сроки службы стоматологических конструкций также могут быть полезны при формировании прогноза:"
      }
    },
    {
      "id": "MRrOTkFbxN",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Имплантат приживется с вероятностью 95-98%, и в 90 % случаев служит пациенту всю жизнь.",
            "items": []
          },
          {
            "content": "Металлокерамическая коронка гарантированно служит 8 лет, через 10 лет у пациентов в ротовой полости остается 89% установленных коронок.",
            "items": []
          },
          {
            "content": "Зубной протез в форме моста прослужит 10 лет с вероятностью 90%.",
            "items": []
          },
          {
            "content": "Срок службы фотополимерной пломбы - всего 5 лет, 10 лет продержатся не более 40% всех пломб, при условии гарантийного обслуживания - шлифовки и полировки.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "-Tzrxcx8-J",
      "type": "header",
      "data": {
        "text": "Стоматологическая клиника «Авторская стоматология терновых» предлагает следующие гарантии своим пациентам:",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "ZJyJnqAIF0",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Мы обеспечиваем справедливую и НЕИЗМЕННУЮ цену на стоматологическое лечение в нашей клинике, которая фиксируется в договоре на оказание медицинских услуг и не меняется в процессе лечения.",
            "items": []
          },
          {
            "content": "Мы гарантируем оказание высококвалифицированной стоматологической помощи. Вся наша работа осуществляется в соответствии Лицензией, а наши специалисты сертифицированы и обладают опытом по применяемым методикам и материалам.",
            "items": []
          },
          {
            "content": "Мы предоставляем ПОЖИЗНЕННУЮ гарантию на стабильность результатов ортодонтического лечения при соблюдении всех рекомендаций нашего ортодонта.",
            "items": []
          },
          {
            "content": "Мы обеспечиваем тщательное рассмотрение всех обращений наших пациентов во внутреннюю службу контроля по поводу качества предоставленного лечения до полного урегулирования вопроса.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "wdieR-rzkP",
      "type": "header",
      "data": {
        "text": "Касательно гарантий качества обслуживания и безопасности в клинике \"Авторская стоматология терновых\":",
        "level": 2,
        "anchor": ""
      }
    },
    {
      "id": "Q0QQZoLBZc",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Мы гарантируем полную инфекционную безопасность во время проведения лечения.",
            "items": []
          },
          {
            "content": "Мы обеспечиваем безопасное применение анестезии, лекарственных препаратов и материалов, используемых в процессе лечения.",
            "items": []
          },
          {
            "content": "Мы предоставляем справедливую и неизменную цену на протяжении всего процесса лечения в соответствии с договором на лечение.",
            "items": []
          },
          {
            "content": "Мы предоставляем пожизненную гарантию на стабильность результатов ортодонтического лечения.",
            "items": []
          },
          {
            "content": "Мы предлагаем возможность получения индивидуальной гарантии на любую стоматологическую услугу, в зависимости от договоренности с лечащим врачом.",
            "items": []
          },
          {
            "content": "Мы гарантируем объективное рассмотрение всех жалоб пациентов по поводу качества обслуживания до полного урегулирования вопроса.",
            "items": []
          }
        ]
      }
    },
    {
      "id": "HYiUCvjVLN",
      "type": "paragraph",
      "data": {
        "text": "Запишитесь на профилактический прием в нашу клинику и убедитесь сами в качестве!"
      }
    },
    {
      "id": "96wWN7O0Oh",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": []
      }
    }
  ]
}