
{
    "title": "Памятка пациенту",
    "slug": "pamyatka-pacientu",
    "content": [
      {
        "id": "22oOQguBBl",
        "type": "paragraph",
        "data": {
          "text": "Успех стоматологического лечения зависит не только от врача-стоматолога, но и от вас, как пациента: вашего подхода к выбору врача, вашего отношения к здоровью, вашей сознательности и ответственности во время лечения. В клинике \"Авторская стоматология Терновых\" мы хотим поделиться с вами основными правилами, соблюдение которых поможет вам восстановить здоровье зубов быстрее или, по крайней мере, избежать проблем, а нам - меньше волноваться о вас."
        }
      },
      {
        "id": "sQyrg2Iku-",
        "type": "header",
        "data": {
          "text": "Как правильно выбрать стоматолога?",
          "level": 2,
          "anchor": ""
        }
      },
      {
        "id": "Xn4sraWni9",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Не оценивайте клиники только по цене. Исследуйте качество лечения, качество сервиса, местоположение и только затем обращайте внимание на стоимость. Приходите на прием, чтобы узнать о проблемах, получить диагноз и оценить риски для вашего здоровья.",
              "items": [
                
              ]
            },
            {
              "content": "Обратите внимание на рекомендации ваших знакомых, но будьте бдительны и не полностью полагайтесь на них. Проведите свое собственное исследование.",
              "items": [
                
              ]
            },
            {
              "content": "Исследуйте клиники, расположенные рядом с вами, чтобы было удобно добираться. Однако будьте осторожны, чтобы не попасть в сомнительную клинику в спальном районе.",
              "items": [
                
              ]
            },
            {
              "content": "Поищите информацию в интернете. Большинство хороших клиник имеют сайты, социальные сети и рекламу. Ознакомьтесь с информацией о квалификации специалистов, используемых материалах, методах лечения, оборудовании и, конечно же, результатам.",
              "items": [
                
              ]
            },
            {
              "content": "Проведите разговор с администратором клиники. Задайте все вопросы, которые вас интересуют, например, о стерилизации инструментов, используемых материалах и стоимости оборудования. Обратите внимание на ясность и информативность ответов.",
              "items": [
                
              ]
            },
            {
              "content": "Не поддавайтесь влиянию помпезности. Как правило средний уровень отличается от люксового только стоимостью ремонта.С учетом расходных материалов и многолетней квалификации врачей стоматологические услуги не могут стоить дешево. Более доступные клиники могут предложить соотношение цены и качества, удовлетворяющее ваши требования.",
              "items": [
                
              ]
            },
            {
              "content": "Рекомендуется посетить несколько консультаций у разных врачей, особенно если у вас сложный случай. Сравните различные подходы к вашей стоматологической проблеме, выберите приемлемую для вас стоимость лечения и найдите врача, с которым вы будете комфортно общаться.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "bqfdrrjV_P",
        "type": "paragraph",
        "data": {
          "text": "Хороший результат требует правильного начала лечения. Вот несколько рекомендаций для выбора стоматолога:"
        }
      },
      {
        "id": "L8FXZL5Mk0",
        "type": "header",
        "data": {
          "text": "Какой врач-стоматолог требуется именно Вам?",
          "level": 2,
          "anchor": ""
        }
      },
      {
        "id": "CFDNT4HSn4",
        "type": "paragraph",
        "data": {
          "text": "Если вы не можете определиться, к какому специалисту стоматологу вам нужно обратиться, вот небольшая подсказка:"
        }
      },
      {
        "id": "290SsS5Mst",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Если у вас болит, ноет зуб или есть кариес, вам следует обратиться к стоматологу-терапевту.",
              "items": [
                
              ]
            },
            {
              "content": "Если зубы потемнели, появились бляшки, камни или есть неприятный запах изо рта, вам нужно обратиться к пародонтологу и гигиенисту.",
              "items": [
                
              ]
            },
            {
              "content": "Если у вас воспалились, болят или кровоточат десна, вы можете обратиться как к пародонтологу, так и к хирургу.",
              "items": [
                
              ]
            },
            {
              "content": "Если у вас неровные зубы, неправильный прикус или щелкает челюстной сустав, вам рекомендуется обратиться к стоматологу-ортодонту.",
              "items": [
                
              ]
            },
            {
              "content": "Если зуб полностью разрушен и вызывает боли, или у вас возникли проблемы с прорезыванием зуба мудрости, вам следует обратиться к стоматологу-хирургу.",
              "items": [
                
              ]
            },
            {
              "content": "Если вам требуется восстановление разрушенного или отсутствующего зуба/зубов, вам следует обратиться к стоматологу-ортопеду или хирургу-имплантологу.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "EkFKvfIPeX",
        "type": "header",
        "data": {
          "text": "Как подготовиться к приему у стоматолога?",
          "level": 2,
          "anchor": ""
        }
      },
      {
        "id": "OtFOSdKjZm",
        "type": "paragraph",
        "data": {
          "text": "Для более эффективного приема у стоматолога рекомендуется подготовиться следующим образом:"
        }
      },
      {
        "id": "Z1_0CFsIeZ",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Соберите информацию о себе и своем здоровье.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "CaAPWVHHeH",
        "type": "paragraph",
        "data": {
          "text": "Возьмите с собой все имеющиеся медицинские документы, рентгеновские снимки, выписки и заключения из предыдущих мест лечения. Сообщите стоматологу о недавно перенесенных заболеваниях, хронических состояниях, принимаемых лекарствах и рисках для вашего организма. Если вам предстоит хирургическое вмешательство, врач может направить вас на дополнительные исследования, включая анализ крови. Не забудьте упомянуть осложнения, аллергии на лекарства и предыдущие реакции на анестезию. Если вы беременны или кормите грудью, подробно расскажите врачу о вашем состоянии и задайте все вопросы, которые у вас возникают."
        }
      },
      {
        "id": "sSDdjh-uMj",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Подготовьте список вопросов.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "ES7PXFjmBu",
        "type": "paragraph",
        "data": {
          "text": "Заранее обдумайте и запишите все вопросы, которые вы хотите задать стоматологу. Не ограничивайте себя - это ваше здоровье. Также четко сформулируйте свои жалобы, если они есть, и представьте врачу желаемый результат лечения."
        }
      },
      {
        "id": "7rn37rdpYH",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Позаботьтесь о себе.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "TGTcohIPSr",
        "type": "paragraph",
        "data": {
          "text": "Незадолго до приема у стоматолога легко перекусите, избегая пищи с сильным запахом (чеснок, лук) и алкоголя. Почистите зубы и воспользуйтесь зубной нитью перед приемом. Если вам нужно успокоиться, можно принять натуральные успокоительные средства, такие как валериана или пустырник. Если вы болеете или не чувствуете себя хорошо, лучше перенести визит к стоматологу."
        }
      },
      {
        "id": "V-tV180Zq-",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Учтите, что есть некоторые случаи, когда лечение следует отложить:",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "ks6J_ITrM2",
        "type": "paragraph",
        "data": {
          "text": "- При ОРЗ, простуде, гриппе и других инфекциях дыхательных путей, независимо от наличия лихорадки.<br>- При наличии герпеса, высыпаний на слизистой оболочке, губах или коже.- Во время критических дней.<br>- Во время критических дней.<br>"
        }
      },
      {
        "id": "PDqWr2bVCl",
        "type": "header",
        "data": {
          "text": "Рекомендованные правила после стоматологического лечения",
          "level": 2,
          "anchor": ""
        }
      },
      {
        "id": "W4iETGi1pS",
        "type": "paragraph",
        "data": {
          "text": "После стоматологического лечения врач обычно дает индивидуальные рекомендации пациенту. Следование этим рекомендациям является важным фактором для успешного заживления и обеспечения оптимального результата. Вот несколько общих правил поведения, которые могут быть применимы после стоматологического вмешательства:"
        }
      },
      {
        "id": "Q_lCOJtDny",
        "type": "list",
        "data": {
          "style": "unordered",
          "items": [
            {
              "content": "Следуйте инструкциям врача. Важно внимательно прочитать и понять инструкции, данные врачом. Если возникнут вопросы или непонимание, не стесняйтесь задавать врачу уточняющие вопросы.",
              "items": [
                
              ]
            },
            {
              "content": "Принимайте прописанные лекарства. Если врач назначил вам лекарства (антибиотики, обезболивающие и т.д.), принимайте их в соответствии с указаниями. Не прекращайте лечение без указания врача.",
              "items": [
                
              ]
            },
            {
              "content": "Соблюдайте правила гигиены. После процедур стоматологического лечения особенно важно соблюдать хорошую устную гигиену. Регулярно чистите зубы, используйте зубную нить, ополаскиватель для рта или другие средства, рекомендованные врачом.",
              "items": [
                
              ]
            },
            {
              "content": "Избегайте тяжелых физических нагрузок. Во время заживления после стоматологического вмешательства избегайте интенсивных физических нагрузок, которые могут повлиять на заживление и вызвать дискомфорт.",
              "items": [
                
              ]
            },
            {
              "content": "Следуйте рекомендациям по питанию. Врач может дать вам указания относительно диеты или ограничений в питании после стоматологического лечения. Следуйте этим рекомендациям для обеспечения правильного заживления.",
              "items": [
                
              ]
            }
          ]
        }
      },
      {
        "id": "LF-VmKqBUG",
        "type": "paragraph",
        "data": {
          "text": "Важно помнить, что каждый случай может быть индивидуальным, и следование конкретным рекомендациям врача является приоритетом. Если у вас возникают вопросы или проблемы после лечения, свяжитесь с вашим стоматологом для получения дополнительной консультации."
        }
      }
    ]
  }